# Pandas - Time Method
---

In [1]:
import numpy as np
import pandas as pd

from datetime import datetime

In [2]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30
mysec = 15

In [3]:
mydate = datetime(2015, 1, 1)

In [4]:
mydate

datetime.datetime(2015, 1, 1, 0, 0)

In [5]:
mydatetime = datetime(myyear, mymonth, myday, myhour, mymin, mysec)

In [6]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [7]:
mydatetime.year

2015

In [8]:
myser = pd.Series(['Nov 3, 1990', '2000-01-01', None])

In [9]:
myser

0    Nov 3, 1990
1     2000-01-01
2           None
dtype: object

In [10]:
myser[0]

'Nov 3, 1990'

In [13]:
timeser = pd.to_datetime(myser)

In [14]:
timeser

0   1990-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [15]:
timeser[0]

Timestamp('1990-11-03 00:00:00')

In [16]:
timeser[0].year

1990

In [17]:
obvi_euro_date = '31-12-2000'

In [18]:
pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [19]:
euro_date = '10-12-2000'

In [21]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [22]:
style_date = '12--Dec--2000'

In [23]:
pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [24]:
custom_date = '12th of Dec 2000'

In [25]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [26]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [27]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [29]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [30]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [32]:
sales['DATE'][0].year

1992

In [33]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [34]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [37]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [39]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [40]:
sales = sales.set_index('DATE')

In [43]:
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [44]:
sales.resample(rule='A').var()

            MRTSSM4453USN
DATE
1992-12-31   67233.477273
1993-12-31   52504.515152
1994-12-31   71404.568182
1995-12-31   73799.719697
1996-12-31   55249.477273
1997-12-31   90818.750000
1998-12-31  103480.515152
1999-12-31  135652.060606
2000-12-31  136573.719697
2001-12-31  144821.719697
2002-12-31  128623.424242
2003-12-31  167068.083333
2004-12-31  160652.992424
2005-12-31  227251.659091
2006-12-31  211099.333333
2007-12-31  221931.151515
2008-12-31  208550.545455
2009-12-31  215277.840909
2010-12-31  205564.083333
2011-12-31  248734.242424
2012-12-31  270670.446970
2013-12-31  283479.515152
2014-12-31  338353.424242
2015-12-31  355107.181818
2016-12-31  379768.810606
2017-12-31  420903.333333
2018-12-31  408100.969697
2019-12-31  437724.568182
2020-12-31  309100.333333

In [45]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])

In [46]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [48]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64

In [49]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64